In [1]:
num1=5
num2=9
suma=num1+num2
suma

14

Importamos la libreria de pandas

In [2]:
import pandas as pd

creamos el DataFrame

In [4]:
datos={
    "Nombres": ["Ana", "Adrian", "Lucia", "Antonia"],
    "Edad": [23, 34, 32, 20],
    "Ciudades":["Madrid", "Barcelona", "Salamanca", "Valencia"]
}

creamos un DataFrame con los datos

In [5]:
df=pd.DataFrame(datos)
df

   Nombres  Edad   Ciudades
0      Ana    23     Madrid
1   Adrian    34  Barcelona
2    Lucia    32  Salamanca
3  Antonia    20   Valencia

Voy a filtrar datos por edad

In [6]:
df[df['Edad']>24]

  Nombres  Edad   Ciudades
1  Adrian    34  Barcelona
2   Lucia    32  Salamanca